/****************************************************************************

    character.c
    game character (playable & non-playable)


    Lord of the Rings game engine

    Copyright (C) 2003  Michal Benes

    Lord of the Rings game engine is free software;
    you can redistribute it and/or
    modify it under the terms of the GNU Lesser General Public
    License as published by the Free Software Foundation; either
    version 2.1 of the License, or (at your option) any later version.

    This code is distributed in the hope that it will be useful,
    but WITHOUT ANY WARRANTY; without even the implied warranty of
    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
    Lesser General Public License for more details.

    You should have received a copy of the GNU Lesser General Public
    License along with this code; if not, write to the Free Software
    Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA

*****************************************************************************/


#include "lotr.h"
#include "archive.h"
#include "character.h"
#include "combat.h"
#include "game.h"
#include "map.h"
#include "object.h"
#include "shape.h"
#include "utils.h"
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <libxml/parser.h>


#ifndef TTT
#include "characters_pos.h"
#else
#include "characters_pos_ttt.h"
#endif

Character *lotr_characters[CHARACTERS_NUM];



typedef struct
{
    Uint8 unknown1[6];
    Uint8 shape;                /* 6 */
    Uint8 unknown6[3];          /* 7 */
    Uint8 direction;            /* 10 */
    Uint8 unknown7[2];          /* 11 */
    Uint8 silver;               /* 13 */
    Uint8 horse_shape;          /* 14 */
    Uint8 unknown8;             /* 15 */
    Uint8 dex;                  /* 16 */
    Uint8 life;                 /* 17 */
    Uint8 str;                  /* 18 */
    Uint8 will;                 /* 19 */
    Uint8 unknown4;             /* 20 */
    Uint8 luck;                 /* 21 */
    Uint8 end;                  /* 22 */
    Uint8 unknown3;             /* 23 */
    Uint8 items[10];            /* 24 */
    Uint8 skills[10];           /* 34 */
    Uint8 spells[10];           /* 44 */
    Uint8 name[16];             /* 54 */
    Uint8 id;                   /* 70 */
    Uint8 unknown2[9];          /* 71 */
    Uint8 portrait;             /* 80 */
    Uint8 unknown5[6];          /* 81 */
    Uint8 talks[CHARACTER_TALK_LEN];    /* 87 */
} NpcsDatEntry;



int weapon_offsets[36][4][2] = { {{7, -3}, {10, 1}, {3, 5}, {0, 4},},   /*  0 */
{{0, 0}, {0, 0}, {0, 0}, {0, 0},},      /*  1 */
{{0, 0}, {0, 0}, {0, 0}, {0, 0},},      /*  2 */
{{1, -6}, {6, 2}, {-1, 4}, {-3, 3},},   /*  3 */
{{6, -5}, {10, -3}, {3, 3}, {1, -4},},  /*  4 */
{{6, -4}, {9, -2}, {2, 3}, {-1, 0},},   /*  5 */
{{0, 0}, {0, 0}, {0, 0}, {0, 0},},      /*  6 */
{{0, 0}, {0, 0}, {0, 0}, {0, 0},},      /*  7 */
{{0, 0}, {0, 0}, {0, 0}, {0, 0},},      /*  8 */
{{0, 0}, {0, 0}, {0, 0}, {0, 0},},      /*  9 */
{{0, 0}, {0, 0}, {0, 0}, {0, 0},},      /* 10 */
{{0, 0}, {0, 0}, {0, 0}, {0, 0},},      /* 11 */
{{7, -4}, {8, 2}, {2, 3}, {-2, 4},},    /* 12 */
{{6, -2}, {7, -1}, {0, 1}, {0, 2},},    /* 13 */
{{0, 0}, {0, 0}, {0, 0}, {0, 0},},      /* 14 */
{{0, 0}, {0, 0}, {0, 0}, {0, 0},},      /* 15 */
{{8, 2}, {7, 3}, {3, 8}, {1, 4},},      /* 16 */
{{8, 0}, {9, 2}, {3, 5}, {0, 4},},      /* 17 */
